[
  {
    "Id": 1,
    "rating": 5,
    "reviewText": "Absolutely exceptional dining experience! The wagyu beef tenderloin was cooked to perfection, and the service was impeccable. The ambiance creates the perfect setting for a romantic dinner. Highly recommend the chocolate lava cake for dessert!",
    "reviewerName": "Sarah Johnson",
    "date": "2024-01-15",
    "verified": true
  },
  {
    "Id": 2,
    "rating": 5,
    "reviewText": "Savory Table has become our go-to restaurant for special occasions. The lobster risotto is incredible, and they have excellent vegetarian options too. The staff goes above and beyond to make every visit memorable.",
    "reviewerName": "Michael Chen",
    "date": "2024-01-12",
    "verified": true
  },
  {
    "Id": 3,
    "rating": 4,
    "reviewText": "Great food and atmosphere! The sea bass was fresh and perfectly seasoned. The wine selection is impressive. Only minor complaint is that it can get quite busy, so reservations are definitely recommended.",
    "reviewerName": "Emily Rodriguez",
    "date": "2024-01-10",
    "verified": true
  },
  {
    "Id": 4,
    "rating": 5,
    "reviewText": "Outstanding restaurant! The pan-seared scallops were divine, and the mushroom wellington exceeded all expectations for a vegetarian main course. The presentation of every dish was restaurant-quality perfection.",
    "reviewerName": "David Thompson",
    "date": "2024-01-08",
    "verified": true
  },
  {
    "Id": 5,
    "rating": 5,
    "reviewText": "Phenomenal experience from start to finish. The charcuterie board was an excellent start to our meal, and the burrata caprese was fresh and flavorful. The tiramisu was the perfect ending to a perfect evening.",
    "reviewerName": "Lisa Park",
    "date": "2024-01-05",
    "verified": true
  },
  {
    "Id": 6,
    "rating": 4,
    "reviewText": "Wonderful restaurant with a warm, inviting atmosphere. The food quality is consistently excellent, and the craft cocktails are expertly mixed. Perfect for both intimate dinners and celebrations with friends.",
    "reviewerName": "James Wilson",
    "date": "2024-01-03",
    "verified": true
  },
  {
    "Id": 7,
    "rating": 5,
    "reviewText": "This place never disappoints! The attention to detail in every dish is remarkable. The crème brûlée is absolutely heavenly, and their wine recommendations always pair perfectly with the meal.",
    "reviewerName": "Amanda Foster",
    "date": "2023-12-28",
    "verified": true
  },
  {
    "Id": 8,
    "rating": 4,
    "reviewText": "Excellent food and service! The wagyu beef was tender and flavorful, though a bit pricey. The ambiance is sophisticated and perfect for special occasions. Will definitely be coming back!",
    "reviewerName": "Robert Martinez",
    "date": "2023-12-25",
    "verified": true
  }
]